-- Лабораторна робота №4
-- студентки групи КН-32 підгрупи 1
-- Гумен Ольга
-- Варіант №10

-- Мета: Ознайомитись з системою типiв та класiв типiв. 
-- Набути досвiду визначення нових типiв та класiв типiв i їх використання.

-- Завдання. Публiкацiї.
-- Зберiгаються данi про публiкацiї, якi можуть бути книгою (автор/спiвавтори, назва, мiсто, видавництво, рiк), 
-- статтею (автор/спiвавтори, назва статтi, назва журналу, рiк, номер журналу, сторiнки)
-- або тезами доповiдi (автор/спiвавтори, назва доповiдi, назва конференцiї, мiсто, рiк, сторiнки). 
-- Визначне функцiї для :

-- 10. статистика публiкацiй автора — кiлькiсть, обсяг (у сторiнках), тип;



-- Висновок: Під час даної лабораторної роботи я ознайомилась з системою типiв та класiв типiв. 
-- Також я набула досвiду визначення нових типiв та класiв типiв i їх використання після чого застосувала вивчене на практиці.