-- Лабораторна робота №2
-- студентки групи КН-32 підгрупи 1
-- Гумен Ольга
-- Варіант №10

-- Мета: Набути досвiду визначення рекурсивних функцiй, 
-- використання механiзму зiставлення зi зразком i роботи з кортежами та списками.

-- Завдання 1. Визначте вказанi функцiї в кожному з завдань:
-- а) без застосування, 
-- б) з застосуванням вбудованих функцiй.

-- 1.10 Визначити частоту кожного елемента списку, напр.: 
-- "aaabbcaadddd"⇒[(’a’,5), (’b’,2), (’c’,1), (’d’,4)].

-- a)
import Data.List 

frequency :: (Ord a) => [a] -> [(a, Int)]

frequency list xs = toList (fromListWith (+) [(x, 1) | x <- xs])

-- Завдання 2. Видалити зi списку елементи з i-го по k-й включно, напр. 
-- при i=2 та k=4: "asdfghj"⇒ "aghj".

-- 2.10 Знайти простi дiльники числа.



-- Висновок: Під час даної лабораторної роботи я ознайомилась з мовою Haskell та інтерпретатором ghci, також я ознайомилась
-- з основними типами мови, зі структурою та функціями мови та застосувала вивчене на практиці.